// <table>
// 표 (전체)
// 표 전체를 감싸는 데 사용

// <caption>
// 표의 제목이나 설명 작성

// <tr>
// 표의 행 (표 가로)
// 자식으로 <th>나 <td> 필수

// <th>
// 표의 제목 열
// 부모인 <tr>태그 안에 위치

// <td>
// 표의 열 (표 세로)
// 부모인 <tr>태그 안에 위치

// <colgroup>
// 열을 그룹으로 묶는 태그

// <col>
// <colgroup>태그의 자식으로 열 단위를 나눔
// span 속성을 사용해 열을 그룹으로 묶을지 설정
// ex) <col span="3">은 세 열을 그룹으로 묶음

// <head>
// 표의 제목 열들을 묶음

// <tbody>
// 표의 일반적인 데이터를 묶음
// 행그룹태그를 사용하지 않으면 크롬브라우저가 자동으로 <tbody>로 묶음

// <tfoot>
// 표의 하단 영역을 묶는 태그

// colspan
// 열 병합
// ex) <td colspan="2"></td>

// rowspan
// 행 병합
// ex) <td rowspan="2"></td>
