// 시맨틱(Semantic: 의미론적) 태그
// 의미를 가지는 태그
// 검색엔진 최적화
// 웹 접근성 향상
// 코드 가독성 향상
// 용도에 맞게 적절히 사용해야 함

// <header>
// 페이지에 대한 정보
// 페이지 상단에 위치

// <nav>
// 네이게이션 링크로 구성

// <aside>
// 페이지 전체 내용과는 관련이 있지만 주 내용과는 관련이 없는 내용

// <main>
// 문서의 body요소의 주 컨텐츠(main contents)정의 시 사용

// <section>
// 문서나 응용프로그램의 일반적인 섹션

// <article>
// 여러가지 아이템들을 묶어 재사용

// <footer>
// 주로 저작권 정보나 서비스 제공자 정보

// <details>
// 추가 정보를 나타내거나 사용자가 요청하는 정보
// 페이지 하단에 위치

// <summary>
// 부모 요소인 details요소의 내용에 대한 요약 혹은 캡션

// <figcaption>
// 부모 요소인 figure요소의 내용들에 대한 캡션 혹은 제목

// <figure>
// 일러스트, 다이어그램, 사진, 코드 등에 주석을 다는 용도

// <mark>
// 참조 목적으로 마킹되거나 하이라이트로 된 텍스트 표현

// <time>
// 24시간에서 시간 혹은 그레고리력에서 정밀한 날짜를 나타냄

// 웹 사이트마다 레이아웃 다름

// div는 가독성이 떨어지지만 시멘틱 태그는 뚜렷함
